AcDbObjectId.convertToRedirectedId
Change this id's value to the host id value, if this id is currently being
redirected (forwarded) from an xref database to one in the host database.
Otherwise, do nothing.
Returns: True if the id was redirected, otherwise false.
Remarks: Only ids of symbol table records can be redirected

AcDbObjectId.isWellBehaved
Checks, in a safe way (using an exception handler), whether this AcDbObjectId
is "well behaved".
Well-behaved ids may be null, valid or "stale", or they may be a garbage value
which happens to fail gracefully (without crashing) when operated on.
Returns: True if this id is well-behaved, false otherwise.
Remarks: It is safe to call functions like acdbOpenObject() and methods like
objectClass(), database() and handle() on any well-behaved id.
Non-well-behaved ids, however, can cause crashes in these functions.
"Stale" ids are those which were once valid but whose owning
AcDbDatabase has been destroyed, making them now invalid
This method may have performance overhead if called in a tight loop.

AcDbObjectId.isValid
Checks, in a safe way (using an exception handler), whether this AcDbObjectId is valid.
Valid ids are non-null and map to a non-null AcDbHandle (and to an AcDbObject) in an
existing AcDbDatabase.
Returns: True if the id is valid, false otherwise.
Remarks: Even though an id is valid, the AcDbObject it refers to may fail to open.
This method may have performance overhead if called in a tight loop.